# ExternalResourceLoadContext Properties

---
The ExternalResourceLoadContext type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LoadOperationType|  An enum value indicating whether the resource load was triggered by an automatic event (such as file open) or an explicit user action.
Top
#### Reference
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace